[
  {
    "company": "Monitor Deloitte",
    "projects": [
      {
        "projectName": "Dell Partner Strategy Assessment and Digital Transformation",
        "engagements": [
          {
            "skill_bucket": "Account Management",
            "skill": "Channel Strategy",
            "situation": "A global hardware & services provider’s partner/channel program was burdened by dozens of incentive plans, unclear partner classifications, and a legacy tech stack that couldn’t support a pending ERP migration.",
            "task": "As Strategy Consultant, I was asked to assess channel performance, partner types, and product hierarchies, then redesign the incentives framework to simplify plans, improve transparency, and align payouts with revenue goals.",
            "result": "Reduced incentive plan count by 68%, cutting administrative overhead and user confusion. Improved payout-to-revenue alignment, enabling more accurate forecasting of channel spend and ROI. Laid the groundwork for a scalable, ERP-enabled incentives engine that supports future growth without manual intervention.",
            "tags": ["Sales Transformation", "Lead to Order", "Program Management"]
          }
        ]
      }
    ]
  },
  {
    "company": "Accenture Strategy",
    "projects": [
      {
        "projectName": "Google Cloud Chief of Staff",
        "engagements": [
          {
            "skill_bucket": "Strategy & Operations",
            "skill": "Chief of Staff",
            "situation": "Client's Cloud consulting division was hyper-scaling and needed a more structured, efficient GTM and pre-sales delivery model.",
            "task": "As Chief of Staff to the Strategy Director, I was tasked with designing a scalable GTM framework and operational mechanisms to improve pipeline visibility and delivery turnaround.",
            "result": "Enabled faster GTM execution, 9x growth in dashboard usage (DAU), improved pipeline visibility, and higher sales team penetration through smarter quota allocation.",
            "tags": ["Product Management", "Program Management", "Sales Transformation"]
          },
          {
            "skill_bucket": "Strategy & Operations",
            "skill": "GTM",
            "situation": "Google Cloud's consulting division needed to scale rapidly across direct and partner-led sales channels.",
            "task": "Define a future-ready GTM framework to streamline offering design, pricing, and delivery motions.",
            "result": "Reduced RFP turnaround time from ~2 months to 4 days and enabled faster go-to-market alignment across global teams.",
            "tags": ["Sales Transformation", "Program Management"]
          },
          {
            "skill_bucket": "Strategy & Operations",
            "skill": "Growth Enablement",
            "situation": "Leadership lacked clarity on how pre-sales delivery was contributing to pipeline progression and revenue acceleration.",
            "task": "Build visibility and tools to support data-driven decision-making for high-growth execution.",
            "result": "Achieved a 9x increase in dashboard DAU, improved tracking of sales contribution, and supported more predictable growth outcomes.",
            "tags": ["Sales Transformation", "Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Strategy & Operations",
            "skill": "RCA Strategy & Insights",
            "situation": "Fragmented ownership, inconsistent pipeline tracking, and unclear accountability across pre-sales teams were slowing strategic execution.",
            "task": "Build a system to centralize ownership, surface actionable insights, and align sales processes to strategic goals.",
            "result": "Significantly improved sales ops hygiene, boosted leader visibility, and laid groundwork for scalable operations at global level.",
            "tags": ["Sales Transformation", "Program Management"]
          },
          {
            "skill_bucket": "Program Management",
            "skill": "Program Management",
            "situation": "Scaling delivery and GTM operations across global markets required structured program oversight and cross-functional execution.",
            "task": "Coordinate across teams to implement key GTM programs—pricing alignment, pipeline visibility, and resource allocation.",
            "result": "Deployed offerings and dashboards used across 8 countries, driving faster turnaround and standardized execution globally.",
            "tags": ["Program Management"]
          },
          {
            "skill_bucket": "Sales Transformation",
            "skill": "Sales Transformation",
            "situation": "Legacy sales motions lacked clarity on engagement models, accountability, and turnaround expectations.",
            "task": "Transform pre-sales structure to improve pipeline efficiency, team productivity, and strategic targeting.",
            "result": "Improved sales coverage strategy, enhanced pipeline quality, and accelerated deal cycles through strategic restructuring.",
            "tags": ["Sales Transformation", "Program Management"]
          }
        ]
      },
      {
        "projectName": "DuluxGroup",
        "engagements": [
          {
            "skill_bucket": "Maturity Assessment",
            "skill": "Current State Assessment",
            "situation": "Assess whether client needs to improve CPQ process & tools.",
            "task": "Led 5 client SBUs on a sales quote process transformation assessment journey impacting $ 1.2 Bn annual turnover.",
            "result": "Devised CPQ transformation journey across 3 stages permitting cross-SBU learning translation from high maturity SBUS to low maturity SBUs.",
            "tags": ["Pricing, CPQ, Loyalty"]
          },
          {
            "skill_bucket": "Maturity Assessment",
            "skill": "Opportunity Identification",
            "situation": "Manage complex internal business structure to optimize maturity improvement.",
            "task": "Identify areas of improvement & best way to reach target state.",
            "result": "Achieved staggered value realization by utilizing staggered pilots basis BU maturity.",
            "tags": ["Pricing, CPQ, Loyalty"]
          },
          {
            "skill_bucket": "Process Design",
            "skill": "Process Design",
            "situation": "Assess client's high growth services business for potential people, tech, process based roadblocks.",
            "task": "Carve out scaling challenges for client's services business.",
            "result": "Proposed Novel process re-structuring to meet the SBU’s 400% per annum growth targets.",
            "tags": ["Pricing, CPQ, Loyalty"]
          }
        ]
      },
      {
        "projectName": "ADNOC",
        "engagements": [
          {
            "skill_bucket": "Process Design",
            "skill": "Payment Standardization",
            "situation": "Enable client for standardizing payment process across different customer engagement scenarios.",
            "task": "Centralize & standardize client's fragmented payment processes & tools for achieving scaled efficiencies.",
            "result": "Created novel payment mechanism framework to standardize fuel & retail post-auth billing across 8 permutations of customer engagement scenarios impacting $4.3 Bn annual revenue across 480 retails station.",
            "tags": ["Pricing, CPQ, Loyalty"]
          },
          {
            "skill_bucket": "Process Design",
            "skill": "Process Design",
            "situation": "Cover user roles across transaction journeys.",
            "task": "Design process across scenarios to show activity ownership across roles.",
            "result": "Created strategy and implementation guide map and process flow requirements document for development team and bank partner teams to build supporting backend and front-end products.",
            "tags": ["Pricing, CPQ, Loyalty"]
          },
          {
            "skill_bucket": "Product Management",
            "skill": "Product Management",
            "situation": "Bring client's processes & tools into present.",
            "task": "Ensure transition readiness to shift to singular payment terminal & post-auth payment mechanism.",
            "result": "Led client engagement for Product Transition and standardization strategy impacting $4.3 Bn annual revenue across 480 retails stations by replacing 3500+ fragmented device fleet to a customized Android based Payment terminal.",
            "tags": ["Pricing, CPQ, Loyalty", "Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Product Management",
            "skill": "Product Ownership",
            "situation": "Enable partners to deploy target-state process & tools.",
            "task": "Create target-state document & RACI.",
            "result": "Captured transition risks to minimize revenue leakage and frauds across the transaction stages.",
            "tags": ["Pricing, CPQ, Loyalty", "Product Management", "Program Management"]
          }
        ]
      },
      {
        "projectName": "Rogers & Shaw",
        "engagements": [
          {
            "skill_bucket": "Sales Transformation",
            "skill": "Merger & Acquisition- Territory Restructuring",
            "situation": "Assess sales team performance, revenue centers, top and bottom performing accounts for post-merger acquisition plan.",
            "task": "Identify synergy scope and relationship drivers between wireline and wireless offerings post-merger.",
            "result": "Storyboarded the findings to be presented to the joint steering committee.",
            "tags": ["Account Management", "Sales Transformation"]
          }
        ]
      },
      {
        "projectName": "Schneider Electric",
        "engagements": [
          {
            "skill_bucket": "Sales Transformation",
            "skill": "Sales Transformation",
            "situation": "Identify best way to attract millenial customers & compete with upcoming D2C brands.",
            "task": "Lead sales transformation recommendation of the Home and Distributor electrical supplies vertical impacting $ 700 Mn revenue.",
            "result": "Devised GTM revision for hybridization of sales team to unlock 33% additional coverage.",
            "tags": ["Account Management", "Sales Transformation"]
          }
        ]
      },
      {
        "projectName": "IFFCO GBS Assessment & Design",
        "engagements": [
          {
            "skill_bucket": "Process Design",
            "skill": "Current State Assessment",
            "situation": "Assess Sales team activities for centralization potential.",
            "task": "Conduct current state maturity assessment workshops (by Sales L2 process).",
            "result": "Assessed client maturity across 40 L3 capabilities across sales & marketing, highlighted pain points & opportunities​ under 10+ quick wins in Sales and Marketing and developed 5-year GBS transition roadmap​.",
            "tags": ["Sales Transformation", "Lead to Order", "Order to Cash"]
          },
          {
            "skill_bucket": "Process Design",
            "skill": "Org Design",
            "situation": "Design Sales GBS Org to be process-centric & support pre-defined GBS operations.",
            "task": "Design high-level & detailed org, skills & competencies needed, and hiring waves.",
            "result": "Aligned detailed org, roles & responsibilities with the GPO impacting 187 FTE.",
            "tags": ["Sales Transformation", "Program Management"]
          },
          {
            "skill_bucket": "Process Design",
            "skill": "Process Design",
            "situation": "Design GBS & BU engagement model to prepare for future-state operations.",
            "task": "Align L4-L5 activities and design processes with identified stakeholders.",
            "result": "Proposed global process design for 47 Sales areas at L4/L5 level for interaction between GBS and Business Units.",
            "tags": ["Sales Transformation", "Lead to Order", "Order to Cash"]
          }
        ]
      },
      {
        "projectName": "Biz Dev & GTM",
        "engagements": [
          {
            "skill_bucket": "Biz Dev",
            "skill": "Business Development",
            "situation": "Create Commerce offerings & define GTM to enable leadership help solve client problems.",
            "task": "Build industry based stage 0 POVs to take to clients to help identify pain points and convert to projects.",
            "result": "Identified Industry based commerce macro-trends to identify key pain points and client priorities across Hi-Tech, Banking, Insurance, SaaS industries leading to $350 Mn pipeline.",
            "tags": ["Account Management", "Lead to Order", "Order to Cash"]
          },
          {
            "skill_bucket": "Biz Dev",
            "skill": "Business Development",
            "situation": "Client felt the sales team needed a refresher on account management as the sales team didn't have B2B account management expertise of the same level as competitors.",
            "task": "Client wanted to upskill their sales team and certify the curriculum.",
            "result": "Proposed a $150 k 3 week in-classroom plan which covered enterprise sales reps across 4 central areas planned jointly with a leading B-School as a sales management development program (MDP).",
            "tags": ["Account Management", "Sales Transformation"]
          },
          {
            "skill_bucket": "Biz Dev",
            "skill": "Business Development",
            "situation": "Hardware centric client felt their lead to order and order to cash processes were not equipped to tackle the demand of their high growth services division.",
            "task": "Revise client's lead to cash processes with a strong focus on enabling renewals in the services business ecosystem.",
            "result": "Proposed a $350k 8 week assessment and transformation strategy to build the renewed process and execution sepcifically for the Services business without exiiting their current tech architecture.",
            "tags": ["Account Management", "Sales Transformation", "Lead to Order", "Order to Cash"]
          }
        ]
      }
    ]
  },
  {
    "company": "HP Inc",
    "projects": [
      {
        "projectName": "Account & Operations Management",
        "engagements": [
          {
            "skill_bucket": "Account Management",
            "skill": "Account Management",
            "situation": "Responsible for managing a mix of hunting & farming global & national accounts.",
            "task": "Manage CXO Engagement, own lead-to-cash cycle, cross-sell & up-sell to grow business.",
            "result": "Achieved >100% target for consecutive 4 years, retained 100% SoW in key global accounts with strategic project wins.",
            "tags": ["Account Management", "Sales Transformation", "Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Account Management",
            "skill": "Acquisition Strategy",
            "situation": "Manage accounts with unfavourable business relationship.",
            "task": "Generate business and improve CSAT in competitive accounts.",
            "result": "Acquired multiple competition accounts with the biggest win of a Steel manufacturer worth $2Mn.",
            "tags": ["Account Management", "Sales Transformation", "Pricing, CPQ, Loyalty", "Program Management"]
          },
          {
            "skill_bucket": "Account Management",
            "skill": "Account Development",
            "situation": "Clients tend to purchase from multiple OEMs to spread risk.",
            "task": "Grow SoW in accounts with multiple OEMs present.",
            "result": "Unlocked new opportunity by engaging with CIO on their device security plans and won $800K Thin Client deal. Implemented cross-selling portfolio strategy to increase share-of-wallet, CSAT scores, and 7% ASP increment.",
            "tags": ["Account Management", "Sales Transformation", "Pricing, CPQ, Loyalty"]
          },
          {
            "skill_bucket": "Account Management",
            "skill": "Channel Strategy",
            "situation": "Manage a mix of hunting & farming accounts.",
            "task": "Maximize coverage across tail accounts to generate additional revenue with minimal bandwith congestion.",
            "result": "Generated additional $500K per annum of recurring business.",
            "tags": ["Account Management", "Sales Transformation"]
          }
        ]
      },
      {
        "projectName": "Product & Category Management",
        "engagements": [
          {
            "skill_bucket": "Product Management",
            "skill": "Product Management",
            "situation": "Enable product transition with minimal impact on profitability across key accounts.",
            "task": "Manage product rollovers and retain account business.",
            "result": "Led successful product transitions across 4 generations of products leading to improved CSAT.",
            "tags": ["Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Product Management",
            "skill": "Category Management",
            "situation": "Improve profitability across key accounts to improve long term win-rate.",
            "task": "Optimize category mix for improved offering and higher margins.",
            "result": "Achieved highest Display & Accessories attachment across the country.",
            "tags": ["Account Management", "Pricing, CPQ, Loyalty", "Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Product Management",
            "skill": "Pricing Strategy",
            "situation": "Increase market share and profitability in a shrinking market.",
            "task": "Win critical deals with maximum profitability.",
            "result": "Improved account acquition and profitability in retention accounts.",
            "tags": ["Account Management", "Pricing, CPQ, Loyalty", "Product Management"]
          },
          {
            "skill_bucket": "Product Management",
            "skill": "Change Management",
            "situation": "Lead client through critical workplace technology changes to minimize disruption and client workforce unrest.",
            "task": "Align clients on the subsequent phasing out of multiple ports, transition to USB-C and the portfolio revision needed to stay operational.",
            "result": "Improved attach rate and favourable RFP speccing compred to competition.",
            "tags": ["Account Management", "Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Product Management",
            "skill": "User Journey",
            "situation": "Become a client partner instead of relationship manager by differentiating from transactional to consultative model.",
            "task": "Showcase HP product portfolio to solve client problems and become a consulting partner.",
            "result": "Increased traction as preferred partner for CXOs, won key GCC enablement deals without going through an RFP worth $ 3 Mn including $ 600 K worth of display.",
            "tags": ["Account Management", "Sales Transformation", "Product Management"]
          }
        ]
      },
      {
        "projectName": "Program & Project Management",
        "engagements": [
          {
            "skill_bucket": "Program Management",
            "skill": "Program Management",
            "situation": "Manage order delivery of critical orders for successful client project turnaround.",
            "task": "Run Regular cadence with IT & Projects team communicating de-railers and ensuring timely collection.",
            "result": "Fast-tracked deliveries for orders worth $7Mn across 4 key accounts by 2 weeks during Covid by achieving HP leadership visibility.",
            "tags": ["Account Management", "Product Management", "Program Management"]
          },
          {
            "skill_bucket": "Program Management",
            "skill": "E-Com Platform User Onboarding",
            "situation": "Improve brand recall by becoming preferred brand for the client workforce(s).",
            "task": "Onboard key accounts as corporate customers for CEPP (Corporate Employee Purchase Program).",
            "result": "Improved brand recall and end user positive sentiment.",
            "tags": ["Product Management", "Program Management"]
          }
        ]
      },
      {
        "projectName": "Client Project Advisory",
        "engagements": [
          {
            "skill_bucket": "CXO Advisory",
            "skill": "Workforce Productivity Reinvention",
            "situation": "Advise CIO & CHRO on fastest way to realize workforce productivity gains for 6000 FTE GBS setup.",
            "task": "Minimize manual confirmation and assessment TAT for users, lead end-to-end engagement till delivery and user engagement to ensure high concept utilization.",
            "result": "Resulted in increased output per employee, minimized downtime, flexible working environment resulting in upto 40% reduction in manual confirmation and assessment TAT.",
            "tags": ["Product Management"]
          },
          {
            "skill_bucket": "CXO Advisory",
            "skill": "Customer Experience Transformation",
            "situation": "Improve CX by streamlining KYC & documentation process.",
            "task": "Minimize repetition requirements for end-users.",
            "result": "Reduced KYC & courier acceptance TAT by 30% with improved detail capturing accuracy.",
            "tags": ["Product Management"]
          },
          {
            "skill_bucket": "CXO Advisory",
            "skill": "Queue Busting Billing Transformation",
            "situation": "Introduce flexible billing capacity across ground workforce.",
            "task": "Enable ground sales team to bill clients during rush hours.",
            "result": "Created a hybrid sales-cashier role to increase productivity and billability of all resources.",
            "tags": ["Sales Transformation", "Product Management"]
          },
          {
            "skill_bucket": "CXO Advisory",
            "skill": "Edge computing Enablement on Legacy infrastructure",
            "situation": "Support client in moderning legacy manufacturing infrastructure.",
            "task": "Provide Cost-optimal solution to collect live data from legacy manufacturing infrastructure.",
            "result": "Helped client gain extended life out of Manufacturing CapEx.",
            "tags": ["Product Management"]
          }
        ]
      },
      {
        "projectName": "Sales Analytics & Incentive Planning",
        "engagements": [
          {
            "skill_bucket": "Quota Distribution & incentive planning",
            "skill": "Quota Distribution & Attainment",
            "situation": "Manage Mfg team's top-down & bottom-up quota alignment and distribution across Account Managers.",
            "task": "Deploy quota for West 1 MFG team to optimize attainment frequency against account patch.",
            "result": "Improved quota attainment frequency from 2/5 to 5/5 over 4 halves and optimized overachievement payouts by deploying in-line targets.",
            "tags": ["Sales Transformation"]
          },
          {
            "skill_bucket": "Quota Distribution & incentive planning",
            "skill": "Incentive & Compensation Management",
            "situation": "Improve product mix for value products.",
            "task": "Update incentive plan to increase the focus on premium & value products.",
            "result": "Increased sales of premium portfolio, displays, & accessories by 200% over a year.",
            "tags": ["Sales Transformation", "Product Management"]
          }
        ]
      }
    ]
  }
]